# 1. Берем за основу официальный образ Linux с уже установленным Python 3.11
FROM python:3.11

# 2. Создаем внутри контейнера папку /app и говорим, что будем работать в ней
WORKDIR /app

# 3. Копируем файл зависимостей с твоего компа внутрь контейнера
COPY requirements.txt .

# 4. Устанавливаем все библиотеки Python
RUN pip install --no-cache-dir -r requirements.txt

# 5. Устанавливаем браузер Chromium для UI-тестов и все его системные зависимости
RUN playwright install --with-deps chromium

# 6. Теперь копируем ВЕСЬ остальной код твоего проекта внутрь контейнера
COPY . .

# 7. Запускаем тесты при старте контейнера
CMD ["pytest"]